app/controllers/confirmations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."confirmation_toke" = ? LIMIT 1  [["confirmation_toke", "Co-l7orTM6psHSFz6BpDaQ"]]
---
  def show
    user = User.find_by(confirmation_toke: params[:toke])