app/controllers/users_controller.rb

INSERT INTO "users" ("full_name", "location", "email", "password_digest", "bio", "created_at", "updated_at", "confirmation_toke") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save